// 1.  - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = +prompt( "Введіть хв від 0 до 59" );
// if(time >= 0 && time <= 15 ){
//     console.log('перша четверть')
// }else if(time >= 16 && time <= 30 ){
//     console.log('друга четверть')
// }else if(time >= 31 && time <= 45 ){
//     console.log('третя четверть')
// }else if(time >= 46 && time <= 59 ){
//     console.log('четверта четверть')
// }else {
//     document.write('Not the right minute')
// }

// 2. У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = +prompt('Введіть якесь число від 1 до 31')
// if (day >=1 && day <=10) {
//     console.log('Перша декада')
// } else if(day >=11 && day <=20){
//     console.log('Друга декада')
// } else if (day >=21 && day <=31){
//     console.log('Третя декада')
// }else {
//     document.write('Введыть число від 1 до 31')
// }

// 3. У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = true;
// if(test){
//     console.log('Вірно')
// }else {
//     console.log('Не вірно')
// }
// test ? console.log('Вірно'): console.log('Не вірно')

// 4. Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let day = +prompt('Введіть день');
// switch (day) {
//     case 1 :
//         console.log('Понеділок-піти в зал');
//         break;
//     case 2 :
//         console.log('Вівторок-купити продукти');
//         break;
//     case 3 :
//         console.log('Середа-поприбирати в квартирі');
//         break;
//     case 4 :
//         console.log('Четверг-помити вікна')
//         break;
//     case 5 :
//         console.log('Пятниця-помити машину')
//         break;
//     case 6 :
//         console.log('Субота-заправити машину')
//         break;
//     case 7 :
//         console.log('Неділя-скачати фільм')
//         break;
//     default:
//         console.log('Не правильне число')
// }

//  5. Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = +prompt('Введіть рік')
// if (year % 4 === 0) {
//     console.log('високосний рік')
// } else {
//     console.log('не високосний рік')
// }
// year % 4 === 0 ? console.log('+') : console.log('-')


// 6. Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let name = prompt('Яка «офіційна» назва JavaScript?')
// if (name === 'ECMAScript'){
//     alert('Правильно')
// }else {
//     alert('Не знаєте? ECMAScript!')
// }

// name === 'ECMAScript'? alert('Правильно') : alert('Не правильно')
