// 1 .Користувач вводить або має два числа.
//   Потрібно знайти та вивести максимальне число з тих двох .
//   Також потрібно врахувати коли введені рівні числа.
//
// let user = +prompt('Введіть число');
// let user2 = +prompt('Введыть число');
// if(user > user2){
//     console.log(user)
// }else if (user2 < user){
//     console.log(user)
// }else {
//     console.log(user = user2)
// }



// 2. У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let flat = +prompt('Введіть номер квартири від 1 до 90')
// if (flat >=1 && flat <=20 ){
//     alert('1під\'їзд')
// } else if (flat >=21 && flat <=48 ){
//     alert('2 під\'їзд')
// }else if (flat >=49 && flat <=90 ) {
//     alert('3 під\'їзд')
// }else {
//     alert('Введіть до 90 кв')
// }



// 3. Ми маємо змінну number в яку користувач задає числове значення,
//    якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Задайте числове значення від 1 до 10.')
// if (number === 10){
//     alert('Вірно')
// }else{
//     alert('Невірно')
// }



// 4. Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//
// let x = 10;
// if (typeof x === 'number'){
//     document.write('це число')
// }else if(typeof x === 'string'){
//     document.write('це текст')
// }else if (typeof x === 'boolean'){
//     document.write('це булеве')
// }else if (typeof x === 'object'){
//     document.write('це обєкт,масив')
// }else {
//     document.write('не правильно')
// }



// 5.  Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let game = +prompt('Введіть температуру на дворі')
// if (game >=+10 && game <=+22){
//     alert('Ми йдемо ВЧИТИСЯ!')
// }else {
//     alert('Сидимо вдома і вчимося ОНЛАЙН')
// }



// 6. За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5.
//    І взалежності від введеного
//    числа нам дається приз. (Авто, Мото, Телефон, і т.д )
//    і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let game = +prompt('Введіть число від 1 до 5.');
// switch (game) {
//     case 1 :
//         alert('Вітаємо Ви виграли Автомобіль');
//         break;
//     case 2 :
//         alert('Вітаємо Ви виграли Ноутбук');
//         break;
//     case 3 :
//         alert('Вітаємо Ви виграли Телевізор');
//         break;
//     case 4 :
//         alert('Вітаємо Ви виграли Холодильник');
//         break;
//     case 5 :
//         alert('Вітаємо Ви виграли Смартфон');
//         break;
//     default:
//         alert('Число не вірне');
// }