// Всі функції повинні бути описані стрілочним типом!!!!
//     - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
// - створити функцію яка повертає найбільше число з масиву
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].


//     - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)


// let foor = (a, b, c) => {
//     if (a < b && a < c) {
//         return a
//     }
//     if (b < c && b < a) {
//         return b
//     }
//     if (c < b && c < a) {
//         return c
//     }
// }
// console.log(foor(100,45,20))


// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)

// let foor = (a, b, c) => {
//     if (a > b && a > c) {
//         return a
//     }
//     if (b > c && b > a) {
//         return b
//     }
//     if (c > b && c > a) {
//         return c
//     }
// }
// console.log(foor(100,45,20))


// - створити функцію яка повертає найбільше число з масиву

// let list = [100, 500, 1000, 3003];
//
// let maxNumber = (a, b) => {
//     return a > b ? a : b;
// }
// console.log(list.reduce(maxNumber))

// let list = [100, 500, 1000, 3003];
//
// let max = (list) => {
//     return list.reduce((a, b,) => a > b ? a : b);
// }
//
// console.log(max(list))

// - створити функцію яка повертає найменьше число з масиву

// let list = [100, 500, 1000, 3003];
//
// let minNumber = (a, b) => {
//     return a < b ? a : b;
// }
// console.log(list.reduce(minNumber))

// let list = [100, 500, 1000, 3003];
//
// let min = (list) => {
//     return list.reduce((a, b,) => a < b ? a : b);
// }
//
// console.log(min(list))


//- створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13

// let number = [100, 500, 1000, 3003];
// let result = (previousValue, currentValue) => previousValue + currentValue;
//
// console.log(number.reduce(result))



// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.

// let arr = [3, 6, 2, 9];
//
// function foo(arr) {
//     return arr.reduce((partial_sum, a) => partial_sum + a, 0) / arr.length;
// }
// console.log(foo([3, 6, 2, 9]));

