// Всі функції повинні бути описані стрілочним типом!!!!
//     - створити функцію яка обчислює та повертає площу прямокутника висотою
// - створити функцію яка обчислює та повертає площу кола
// - створити функцію яка обчислює та повертає площу циліндру
// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка  створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.


//- створити функцію яка обчислює та повертає площу прямокутника висотою

// let number = (a, b) => {
//     return  a * b;
// }
// console.log(number(5, 5));
// document.write("Площа прямокутник " , number(5, 5))


// - створити функцію яка обчислює та повертає площу кола

// let number = (r) => {
//     let rr = r ** 2;
//     return 3.14*rr;
// }
// console.log(number(5))
// document.write('Площа кола ',number(5))


// - створити функцію яка обчислює та повертає площу циліндру

// let cylinder = (r, h) => {
//     let pi = 3.14*2;
//     return pi*r*h;
// }
// console.log(cylinder(4,10))


// - створити функцію яка приймає масив та виводить кожен його елемент

// let arr = [1, 22, 'red', 'apple', 'orange', 333];
//
// let arry = (arr) => {
//     for ( let i = 0; i < arr.length; i++) {
//         console.log(arr[i])
//     }
// }
// arry(arr);


// - створити функцію яка  створює параграф з текстом. Текст задати через аргумент

// let text = (txt) => {
//     document.write(`<p>${txt}</p>`)
//     document.write(`---`)
//     document.write(`<p>${txt}</p>`)
// }
// text(" - створити функцію яка  створює параграф з текстом. Текст задати через аргумент\n")


// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// let text = (txt) => {
//     document.write(`<ul>`)
//     document.write(`<li>${txt}</li>`)
//     document.write(`</ul>`)
// }
// text('// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий\n')
// text('// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий\n')
// text('// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий\n')


// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

// let arr = (text, number) => {
//     document.write(`<ul>`)
//     for (let i = 0; i < number; i++) {
//         document.write(`<li>${text}</li>`);
//     }
//     document.write(`</ul>`)
// }
// arr('створити функцію яка  створює ul з трьома елементами li', 5);
//

//- створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

// let foo = [12, 33, "tree", true];
//
// arr = (foo) => {
//     document.write(`<ol>`)
//     for (let i = 0; i < foo.length; i++) {
//         document.write(`<li>${foo}</li>`);
//     }
//     document.write(`</ol>`)
// }
// arr(foo)


// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
//
// let people = [{id: 1, name: 'Leo', age: 22}, {id: 2, name: 'Leto', age: 25}, {id: 3, name: 'Rio', age: 21}]
// person = (people) => {
//     for (let i = 0; i < people.length; i++) {
//         document.write(`<div>${people[i].id} ${people[i].name} ${people[i].age}</div>`)
//     }
// }
//  person(people)
