// // // // 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
// let numbers = [4,7,2,8,4,9,8,5,6,1];
// let result = (numbers[0]+numbers[1]+numbers[2]+numbers[3]+numbers[4]+numbers[5]+numbers[6]+numbers[7]+numbers[8]+numbers[9]);
// console.log(result)
//

// // 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
//
// let book = {
//     name : 'Левеня',
//     pages :  102,
//     genre : 'Класика',
// }
// console.log(book)

// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори

// let book = {
//     name : 'Істина',
//     pages :  122,
//     genre : 'Класика',
//     author : 'Аліна Цурко','Еран Улішов','Ірина Мазух'
// }
// console.log(book)
//  4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт

// let book = [
//     {name : 'Левеня', pages : 102, genre : 'Класика', author : 'Олег Бурій'},
//     {name : 'Істина', pages : 122, genre : 'Класика', author : ['Аліна Цурко' ,'Еран Улішов','Ірина Мазух']},
// ];
// console.log(book[0])
// console.log(book[1])

// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
//    Значення площі зберігати в змінній s.
//
//     let height = 23;
//     let width = 10;
//     let s = height*width;
//     console.log(s)

// 6.  Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
//      результат помістіть у змінну v.

// let heightC = 10;
// let dC = 4;
// let rC = dC / 2;
// let pi = 3.141;
// let v = pi * heightC * Math.pow(rC, 2);
// console.log(v)
//

// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
//    Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

// let n = 3;
// let m = 4;
// let kG = Math.pow(n, 2) + Math.pow(m, 2)
// let k = Math.sqrt(kG)
// console.log(k)